openfoam2206/tutorials/incompressible/simpleFoam/motorBike/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

cuttingPlane
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   vtk;
    fields          ( p U );

    interpolationScheme cellPoint;

    surfaces
    {
        yNormal
        {
            type        cuttingPlane;
            point       (0 0 0);
            normal      (0 1 0);
            interpolate true;
        }
    }
}


// ************************************************************************* //
